In [1]:
import pandas as pd

In [2]:
###Series

## Serise

In [19]:
odd = [1,3,5,7,9,'Hello']

In [4]:
odd

[1, 3, 5, 7, 9]

In [5]:
pd_odd = pd.Series(odd)

In [6]:
pd_odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [7]:
pd_odd.mean()

5.0

In [9]:
type(1)

int

In [10]:
odd

[1, 3, 5, 7, 9]

In [20]:
odd = pd.Series(odd)
odd.dtypes

dtype('O')

## NaN (Not a Number)

In [34]:
import numpy as np

odd = [1,np.nan,5,7,9]

odd = pd.Series(odd)
odd.dtypes

dtype('float64')

In [35]:
odd.mean()

5.5

In [36]:
value = np.nan

pd.isnull(value)

True

In [37]:
pd.notnull(value)

False

## Data Frame
생성하기

In [63]:
# 파이선의 이중 리스트를 판다스의 데이터 프레임으로 바꿀수 있다. 첫번째 방법이지만 자주 쓰이지 않음. 
#단점은 컬럼이 나오지 않아서 따로 써줘야 함 
order = [
    ['2017-01-01',500, 'confiremd'],
    ['2017-01-08',900, 'confiremd'],
    ['2017-01-09',600, 'canceled'],
]
columns = ['data','price','state']
order = pd.DataFrame(order,columns = columns)
order

         data  price      state
0  2017-01-01    500  confiremd
1  2017-01-08    900  confiremd
2  2017-01-09    600   canceled

In [68]:
#위에보단 지금 이방식을 추천한다고 함, 아래방시은 데이터 붙어있어서 싱크를 맞추기 편하다고함 
# 딕셔너리 안에 리스트를 넣었다고함 
order = {
    'data':['2017-01-01','2017-01-01','2017-01-02'],
    'price':[500,700,200],
    'state':['confirmed','confirmed','canceled']
}
order = pd.DataFrame(order)
order

         data  price      state
0  2017-01-01    500  confirmed
1  2017-01-01    700  confirmed
2  2017-01-02    200   canceled

In [75]:
order= [
    {'data':'2017-01-01','price':400,'state':'confirmed'},
    {'data':'2017-01-01','price':400,'state':'confirmed'},
    {'data':'2017-01-01','price':400,'state':'confirmed'},
]
order = pd.DataFrame(order)
order

         data  price      state
0  2017-01-01    400  confirmed
1  2017-01-01    400  confirmed
2  2017-01-01    400  confirmed

## 데이터 불러와서 읽는 방법

In [83]:
order_url = 'https://bit.ly/dsa-01-order'
#order = pd.read_csv(order_url,index_col = "id")   #판다스를 사용하면 따로 경로를 기입하지 않아도 불러올수 있다. 
order = pd.read_csv(order_url)
order = order.set_index("id")
order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [ ]:
#데이터 프레임에서 맨위는 columns 맨왼쪽은 Index 나머지 값은 value

In [84]:
order.index

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64', name='id')

In [86]:
order.columns

Index(['user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

In [89]:
order.values

array([[3, 9, '2017-01-01', 500, 'Seoul', 'confirmed'],
       [1, 7, '2017-01-03', 700, 'Seoul', 'confirmed'],
       [3, 8, '2017-01-03', 900, 'Daejeon', 'confirmed'],
       [4, 2, '2017-01-07', 500, nan, 'canceled'],
       [7, 3, '2017-01-09', 700, 'Incheon', 'confirmed'],
       [5, 7, '2017-01-09', 600, 'Busan', 'canceled'],
       [2, 5, '2017-01-10', 200, nan, 'canceled']], dtype=object)

In [90]:
type(order.index)

pandas.core.indexes.numeric.Int64Index

In [99]:
#columns명 바꾸기 
order.clonmns = ['user_id','product_id','data','amount','address','result']
order

C:\Users\APROS-1\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [101]:
order.head(3)

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed

In [102]:
order.tail(1)

    user_id  product_id        date  price address     state
id
7         2           5  2017-01-10    200     NaN  canceled

## pands로 데이터를 분석한다
## 기본연산

In [110]:
order["price"].mean()

585.7142857142857

In [111]:
order["price"].min()

200

In [112]:
order["price"].max()

900

In [114]:
order["price"].describe()     #한번에 다 구해주는 함수

count      7.000000
mean     585.714286
std      219.306266
min      200.000000
25%      500.000000
50%      600.000000
75%      700.000000
max      900.000000
Name: price, dtype: float64

In [117]:
order["state"].unique()    ##갯수와 종류가 파악되지 않을때가 있다  unique() 중복을 제거해준다

array(['confirmed', 'canceled'], dtype=object)

In [122]:
order["state"].value_counts()   #갯수를 알려준다

confirmed    4
canceled     3
Name: state, dtype: int64

In [124]:
order["state"].value_counts(normalize= True) #전체에서 상대적인 수치 몇 %인지 알려줌(normalize= True)

confirmed    0.571429
canceled     0.428571
Name: state, dtype: float64

## 알아두면 좋을것ㄱ

In [126]:
# state의 값 명칭을 바꾸고 싶을때 .replace("confirmed","confirm").replace("canceld","cancel") ed를 제거 하고싶을때 
order ["state"] = order["state"].replace("confirmed","confirm").replace("canceld","cancel")
order

    user_id  product_id        date  price  address     state
id
1         3           9  2017-01-01    500    Seoul   confirm
2         1           7  2017-01-03    700    Seoul   confirm
3         3           8  2017-01-03    900  Daejeon   confirm
4         4           2  2017-01-07    500      NaN  canceled
5         7           3  2017-01-09    700  Incheon   confirm
6         5           7  2017-01-09    600    Busan  canceled
7         2           5  2017-01-10    200      NaN  canceled

In [132]:
# order["date"] ##그냥 이렇게 읽어오면 판다스는 날짜인지 모름 
order["date"] = pd.to_datetime(order["date"])   #이 옵션을 안 할 경우 그냥 object로 인식 날짜로 쓰고 싶다면 무조건 
#order["date"] = pd.to_datetime(order["date"]) 를 넣어줘야한다. 
order["date"].dt.month    #year, month , day 가능 년월일

id
1    1
2    1
3    1
4    1
5    1
6    1
7    1
Name: date, dtype: int64

## 데이터 분석에 도움이되는 기능들

# 행렬 검색하기

In [134]:
order["date"]  #date만 보고싶을때

id
1   2017-01-01
2   2017-01-03
3   2017-01-03
4   2017-01-07
5   2017-01-09
6   2017-01-09
7   2017-01-10
Name: date, dtype: datetime64[ns]

In [136]:
order[["user_id","date","price"]] #여러개의 columns를 보고싶을때 
#왜 괄호를 [[]] 두번쓰는 이유는 무엇인가? 한번만 쓰면 파이썬 문법에서 호환이 되지 않는다. 
#[] > 대괄호고 [] >여기 안에 리스트 타입으로 넣는다.

    user_id       date  price
id
1         3 2017-01-01    500
2         1 2017-01-03    700
3         3 2017-01-03    900
4         4 2017-01-07    500
5         7 2017-01-09    700
6         5 2017-01-09    600
7         2 2017-01-10    200

In [138]:
columns = ["user_id","date","price"]
columns

['user_id', 'date', 'price']

In [139]:
order[columns]

    user_id       date  price
id
1         3 2017-01-01    500
2         1 2017-01-03    700
3         3 2017-01-03    900
4         4 2017-01-07    500
5         7 2017-01-09    700
6         5 2017-01-09    600
7         2 2017-01-10    200

## []대괄호 한번 열고 columns한개 가져오면 Series, 대괄호 두번 열고 가져오면 DataFrame

In [140]:
type(order)

pandas.core.frame.DataFrame

In [141]:
type(order["date"])

pandas.core.series.Series

In [142]:
type(order[["user_id","date","price"]])

pandas.core.frame.DataFrame

In [5]:
#LOW를 가져올때는 어떻게 해야하나 loc == locate
order.loc[1]

NameError: name 'order' is not defined

In [6]:
order.loc[3]

NameError: name 'order' is not defined